duyenle7103/MCU/STM32CODE/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define RED_1_Pin GPIO_PIN_1
#define RED_1_GPIO_Port GPIOA
#define YELLOW_1_Pin GPIO_PIN_2
#define YELLOW_1_GPIO_Port GPIOA
#define GREEN_1_Pin GPIO_PIN_3
#define GREEN_1_GPIO_Port GPIOA
#define RED_2_Pin GPIO_PIN_4
#define RED_2_GPIO_Port GPIOA
#define YELLOW_2_Pin GPIO_PIN_5
#define YELLOW_2_GPIO_Port GPIOA
#define GREEN_2_Pin GPIO_PIN_6
#define GREEN_2_GPIO_Port GPIOA
#define a_1_Pin GPIO_PIN_0
#define a_1_GPIO_Port GPIOB
#define b_1_Pin GPIO_PIN_1
#define b_1_GPIO_Port GPIOB
#define c_1_Pin GPIO_PIN_2
#define c_1_GPIO_Port GPIOB
#define d_2_Pin GPIO_PIN_10
#define d_2_GPIO_Port GPIOB
#define e_2_Pin GPIO_PIN_11
#define e_2_GPIO_Port GPIOB
#define f_2_Pin GPIO_PIN_12
#define f_2_GPIO_Port GPIOB
#define g_2_Pin GPIO_PIN_13
#define g_2_GPIO_Port GPIOB
#define d_1_Pin GPIO_PIN_3
#define d_1_GPIO_Port GPIOB
#define e_1_Pin GPIO_PIN_4
#define e_1_GPIO_Port GPIOB
#define f_1_Pin GPIO_PIN_5
#define f_1_GPIO_Port GPIOB
#define g_1_Pin GPIO_PIN_6
#define g_1_GPIO_Port GPIOB
#define a_2_Pin GPIO_PIN_7
#define a_2_GPIO_Port GPIOB
#define b_2_Pin GPIO_PIN_8
#define b_2_GPIO_Port GPIOB
#define c_2_Pin GPIO_PIN_9
#define c_2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
